libvirt/working_with_virsh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-29 Wed 01:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">

<div id="outline-container-org9b50cf8" class="outline-2">
<h2 id="org9b50cf8">Virsh</h2>
<div class="outline-text-2" id="text-org9b50cf8">
</div>
<div id="outline-container-orge56a3b0" class="outline-3">
<h3 id="orge56a3b0">Getting an overview of the environment</h3>
<div class="outline-text-3" id="text-orge56a3b0">
<ul class="org-ul">
<li>View all VMs running and shutdown</li>
</ul>
<pre class="example">
virsh -c qemu:///system list --all
</pre>

<ul class="org-ul">
<li>View only the running instances</li>
</ul>
<pre class="example">
virsh -c qemu:///system list
</pre>

<ul class="org-ul">
<li>view all the available networks</li>
</ul>
<pre class="example">
virsh -c qemu:///system net-list --all
</pre>

<ul class="org-ul">
<li>view enabled networks</li>
</ul>
<pre class="example">
virsh -c qemu:///system net-list --all
</pre>
</div>
</div>

<div id="outline-container-orgca49194" class="outline-3">
<h3 id="orgca49194">Starting and Stopping Virtual Machines</h3>
<div class="outline-text-3" id="text-orgca49194">
<ul class="org-ul">
<li>start a instance</li>
</ul>
<pre class="example">
virsh -c qemu:///system start centos7
</pre>

<ul class="org-ul">
<li>stop an instance</li>
</ul>
<pre class="example">
virsh -c qemu:///system destory centos7
</pre>

<ul class="org-ul">
<li>suspend/pause an instance</li>
</ul>
<pre class="example">
virsh -c qemu:///system suspend centos7
</pre>
</div>
</div>

<div id="outline-container-org0248557" class="outline-3">
<h3 id="org0248557">Adding a cpu to a Virtual Machine</h3>
<div class="outline-text-3" id="text-org0248557">
<ul class="org-ul">
<li>View information</li>
</ul>
<pre class="example">
virsh -c qemu:///system dominfo centos7
</pre>

<pre class="example">
Id:             -
Name:           centos7
UUID:           092efc5e-a3b0-4c15-a5cd-9a1909ea340f
OS Type:        hvm
State:          shut off
CPU(s):         1
Max memory:     8388608 KiB
Used memory:    8388608 KiB
Persistent:     yes
Autostart:      disable
Managed save:   no
Security model: none
Security DOI:   0
</pre>

<ul class="org-ul">
<li>Adding a cpu to a VM(if running the VM will need to be restarted for the change to take effect)</li>
</ul>
<pre class="example">
virsh -c qemu:///system setvcpus --count 2 --config --domain centos7
</pre>

<ul class="org-ul">
<li>Confirm the increase</li>
</ul>
<pre class="example">
virsh -c qemu:///system dominfo centos7
</pre>
</div>
</div>


<div id="outline-container-org0b41689" class="outline-3">
<h3 id="org0b41689">Change the Memory of a Virtual Machine</h3>
<div class="outline-text-3" id="text-org0b41689">
<ul class="org-ul">
<li>Change the memory of a running instance</li>
</ul>
<pre class="example">
virsh -c qemu:///system setmem --domain centos7 --size 4G
</pre>
<ul class="org-ul">
<li>You are only able to set memory up to the max memory limit</li>

<li>Increase the Max memory limit</li>
</ul>
<pre class="example">
virsh -c qemu:///system setmaxmem --domain centos7 --size 8G --config
virsh -c qemu:///system setmem --domain centos7 --size 8G --config
</pre>
<p>
these commands can be run against an active instance, but will not take effect until a full shutdown has been performed
</p>

<p>
<a href="https://manlug-notes.github.io/notes/index.html">Home</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
